app/views/admin/index.html.erb

    <p>Repositories:</p>
    <%= render partial: 'repo', server_id: @gitserver.id , collection: @gitserver.git_repos if !(@gitserver.git_repos.nil? || @gitserver.git_repos.empty?) %>
---
SELECT "git_repos".* FROM "git_repos" WHERE "git_repos"."git_server_id" = 1