app/controllers/admin_controller.rb

  def index
    @git_model = {}
    server = GitServer.first
    repos = GitRepo.all
---
SELECT "git_servers".* FROM "git_servers" LIMIT 1
SELECT "git_repos".* FROM "git_repos"

  def server_edit
    server = GitServer.find(params[:id])
    server.attributes = params[:post]
    server.save
---
SELECT "git_servers".* FROM "git_servers" WHERE "git_servers"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "git_servers" SET "name" = 'Git Server', "protocol" = 'ssh', "server_address" = 'git', "server_user" = 'gitadmin', "password_digest" = 'adminpwd', "local_dir" = '~/src/Websites/pickling/repos', "edit_with_branches" = 't', "updated_at" = '2013-05-23 22:12:39.136382' WHERE "git_servers"."id" = 1

  def server_new
    server = GitServer.new
    server.name = params[:name]
    server.protocol=params[:protocol]
    server.server_user=params[:server_user]
    server.password_digest=params[:password_digest]
    server.local_dir=params[:local_dir]
    server.save
---
INSERT INTO "git_servers" ("created_at", "edit_with_branches", "local_dir", "name", "password_digest", "protocol", "server_address", "server_user", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)